---
kind: type
id: T:Autodesk.Revit.DB.Structure.AnalyticalSupportType
source: html/df30d98a-d360-a74e-6862-a3db8ac715b0.htm
---
# Autodesk.Revit.DB.Structure.AnalyticalSupportType

Indicates what kind of support another Element provides -- Point, Surface, or Curve.

## Syntax (C#)
```csharp
public enum AnalyticalSupportType
```